# 01-08节

# 开发工具：IDE：Integrated Development Environment
# 是集成了代码编写功能，分析功能、调试功能等一体化的集成环境的开发软件


# 07：【

#打井号就是注释(Ctrl + /是快捷注释)
#需求：（往控制台输出hello world,hello python）

print('hello python')
print('hello world')
print('-----------------')

# 如果要把两行代码写在一行切需要输出两行——使用 ； 分行
# 例：
print('Hello world');print('Hello Python')

# 小结：
# Python文件的后缀名是什么: .py
#注释是什么？具体的写法 答：注释是给开发人员看的，计算机不读写的内容，写法是#开头或者快捷键ctrl + /
# 注意事项：
# 1.写代码时所有符号必须是英文符号（随时注意检查）
# 2.分号（；）作为语句分隔符，使用换行作为终止符
# 】

# 08【

# 在创建目录之后会自动生成两个文件夹
# 【.venv】是保存虚拟环境的文件夹 —————— 通过虚拟的运行环境.venv，可以保证每一个Python项目都在一个相对独立的隔离运行环境中运行，项目之间互不影响
# 【.idea】 存放的是文件的配置信息

# 作业
# 在控制台输出一首诗，分为六行输出，其最终输出形式为：

print('# # # # # # # # # # #')
print('#   白 日 依 山 尽   #')
print('#   黄 河 入 海 流   #')
print('#   欲 穷 千 里 目   #')
print('#   更 上 一 层 楼   #')
print('# # # # # # # # # # #')


